import os

TOKEN = os.environ.get("BOT_TOKEN")
ADMIN_ID = int(os.environ.get("ADMIN_ID", 0)) 

SPONSORS = [
    "@den_mel_76_1" # Убедитесь, что это имя вашего канала
]

PAYMENT_URL = "https://example.com/pay"

TEXTS = {
    "start": "🎁 Добро пожаловать в розыгрыш!\n\nБросай кубик 🎲 и узнай, какой приз тебя ждет!",
    "reviews": "Здесь будут отзывы участников.",
    "task": "Отлично! Теперь выполни задание:\nОставь комментарии под 10 видео и отправь мне 10 скриншотов по одному.",
    "subscribe": "Остался последний шаг! Подпишись на наших спонсоров:",
    "pay": "🎉 Все условия выполнены!\nОформи подписку всего за 1 ₽ и участвуй в розыгрыше!"
}
